quotes = [
{
"quote": "Wherever you go, no matter what the weather, always bring your own sunshine.",
"attribution": "Anthony J. D'Angelo"
},
{
"quote": "In the Spring, I have counted 136 different kinds of weather inside of 24 hours.",
"attribution": "Mark Twain"
},
{  
"quote": "Sunshine is delicious, rain is refreshing, wind braces us up, snow is exhilarating; there is really no such thing as bad weather, only different kinds of good weather.",
"attribution": "John Ruskin"
},
{
"quote": "Weather means more when you have a garden. There's nothing like listening to a shower and thinking how it is soaking in around your green beans.",
"attribution": "Marcelene Cox"
},
{
"quote": "Who cares about the clouds when we're together? Just sing a song and bring the sunny weather.",
"attribution": "Dale Evans"
},
{
"quote": "I'm not an economist and we all know economists were created to make weather forecasters look good.",
"attribution": "Rupert Murdoch"
},
{
"quote": "I love to run. When the weather's bad, I should get on the treadmill in the basement gym of my apartment building, but I lack the motivation.",
"attribution": "Tom Riley"
},
{
"quote": "If the weather is good I go into the nearby wood - there I am painting a small beech forest (in the sun) with a few conifers mixed in. This takes until 8 'o clock.",
"attribution": "Gustav Klimt"
},
{
"quote": "Plants exist in the weather and light rays that surround them - waving in the wind, shimmering in the sunlight. I am always puzzling over how to draw such things.",
"attribution": "Hayao Miyazaki"
},
{
"quote": "A bank is a place where they lend you an umbrella in fair weather and ask for it back when it begins to rain.",
"attribution": "Robert Frost"
},
{
"quote": "Under this window in stormy weather I marry this man and woman together; Let none but Him who rules the thunder Put this man and woman asunder.",
"attribution": "Jonathan Swift"
},
{
"quote": "Farms and ranches contend with much more than quarterly reports and profit margins - the weather can wreak havoc on their quality of life and economic viability. When natural disasters strike, we must do all we can to assist the backbone of our economy.",
"attribution": "Ruben Hinojosa"
},
{
"quote": "We may have bad weather in Ireland, but the sun shines in the hearts of the people and that keeps us all warm.",
"attribution": "Marianne Williamson"
},
{
"quote": "One can't predict the weather more than a few days in advance.",
"attribution": "Stephen Hawking"
},
{
"quote": "Don't knock the weather; nine-tenths of the people couldn't start a conversation if it didn't change once in a while.",
"attribution": "Kin Hubbard"
},
{
"quote": "I've lived in good climate, and it bores the hell out of me. I like weather rather than climate.",
"attribution": "John Steinbeck"
},
{
"quote": "The Bermuda Triangle got tired of warm weather. It moved to Alaska. Now Santa Claus is missing.",
"attribution": "Steven Wright"
},
{
"quote": "The long, dull, monotonous years of middle-aged prosperity or middle-aged adversity are excellent campaigning weather for the devil.",
"attribution": "C. S. Lewis"
},
{
"quote": "An inexhaustible good nature is one of the most precious gifts of heaven, spreading itself like oil over the troubled sea of thought, and keeping the mind smooth and equable in the roughest weather.",
"attribution": "Washington Irving"
},
{
"quote": "There is no such thing as bad weather, only different kinds of good weather.",
"attribution": "John Ruskin"
},
{
"quote": "I love the rain. It's my favorite weather.",
"attribution": "Kristen Wiig"
},
{
"quote": "I love cold weather.",
"attribution": "Seth Rogen"
},
{
"quote": "I was lucky enough to spend some of my school days in Barbados, where my father was working, and this gave me a taste for hot weather.",
"attribution": "Peter Mayle"
},
{
"quote": "Though they don't always have to be set in fog, weather is incredibly important in ghost stories. As is suspense: you've got to turn the screw very, very slowly.",
"attribution": "Susan Hill"
},
{
"quote": "I love England from head to toe. I love the weather, the people. I was there in the summer and it was nice. The people are so groovy.",
"attribution": "Otis Redding"
},
{
"quote": "Never open a book with weather. There are exceptions. If you happen to be Barry Lopez, who has more ways to describe ice and snow than an Eskimo, you can do all the weather reporting you want.",
"attribution": "Elmore Leonard"
},
{
"quote": "Some scientists believe climate change is the cause of unprecedented melting of the North Pole, and that effects these very uncertain weather patterns. I think we should listen to those scientists and experts.",
"attribution": "Dalai Lama"
},
{
"quote": "For there is no friend like a sister in calm or stormy weather; To cheer one on the tedious way, to fetch one if one goes astray, to lift one if one totters down, to strengthen whilst one stands.",
"attribution": "Christina Rossetti"
},
{
"quote": "Let me be the first to tell you, drinking alcohol is the worst thing to do in cold weather. Hot soup is the best because the process of digesting food helps to warm you up.",
"attribution": "Morgan Freeman"
},
{
"quote": "I'm not into cold weather, I like warm weather.",
"attribution": "Amos LeeRead"
},
{
"quote": "The autumn wind is a pirate. Blustering in from sea with a rollicking song he sweeps along swaggering boisterously. His face is weather beaten, he wears a hooded sash with a silver hat about his head... The autumn wind is a Raider, pillaging just for fun.",
"attribution": "Steve Sabol"
},
{
"quote": "If you want to see the sunshine, you have to weather the storm.",
"attribution": "Frank Lane"
},
{
"quote": "It is only in sorrow bad weather masters us; in joy we face the storm and defy it.",
"attribution": "Amelia Barr"
},
{
"quote": "Nature is so powerful, so strong. Capturing its essence is not easy - your work becomes a dance with light and the weather. It takes you to a place within yourself.",
"attribution": "Annie Leibovitz"
},
{
"quote": "I imagine Heaven would have very nice weather - perfect climate where you can wear a leather jacket or shorts and a sweater.",
"attribution": "Hilary Rhoda"
},
{
"quote": "Scarves, mittens, and hats are a great way to express your personality in the cold weather.",
"attribution": "Brad Goreski"
},
{
"quote": "Bad weather always looks worse through a window.",
"attribution": "Tom Lehrer"
},
{
"quote": "Conversation about the weather is the last refuge of the unimaginative.",
"attribution": "Oscar Wilde"
},
{
"quote": "I like the cold weather. It means you get work done.",
"attribution": "Noam Chomsky"
},
{
"quote": "A friendship can weather most things and thrive in thin soil; but it needs a little mulch of letters and phone calls and small, silly presents every so often - just to save it from drying out completely.",
"attribution": "Pam Brown"
},
{
"quote": "Climate is what we expect, weather is what we get.",
"attribution": "Mark Twain"
},
{
"quote": "The weather here is gorgeous. It's mild and feels like it's in the eighties. The hot dog vendors got confused because of the weather and thought it was spring, so they accidentally changed the hot dog water in their carts.",
"attribution": "David Letterman"
},
{
"quote": "It doesn't matter what people say about me, I weather the storm.",
"attribution": "Terrell Owens"
},
{
"quote": "Yes, and there were changes of light on landscapes and changes of direction of the wind and the force of the wind and weather. That whole scene is too important in Homer to neglect.",
"attribution": "Robert Fitzgerald"
},
{
"quote": "I inherited that calm from my father, who was a farmer. You sow, you wait for good or bad weather, you harvest, but working is something you always need to do.",
"attribution": "Miguel Indurain"
},
{
"quote": "In London, the weather would affect me negatively. I react strongly to light. If it is cloudy and raining, there are clouds and rain in my soul.",
"attribution": "Jerzy Kosinski"
},
{
"quote": "Homosexuality is like the weather. It just is.",
"attribution": "Andrew Sullivan"
},
{
"quote": "Everybody talks about the weather, but nobody does anything about it.",
"attribution": "Charles Dudley Warner"
},
{
"quote": "I just know that I could never spend a winter in Chicago or some place like that. I'm just not a cold weather person.",
"attribution": "Emily Robison"
},
{
"quote": "As winter approaches - bringing cold weather and family drama - we crave page-turners, books made for long nights and tryptophan-induced sloth.",
"attribution": "Sarah MacLean"
}
];


